[
  {
    "group": "Economy",
    "articles": [
      {
        "site": "The Business Times",
        "title": "The old Thong Chai Building, a national monument, set to change hands",
        "url": "https://www.businesstimes.com.sg/property/old-thong-chai-building-national-monument-set-change-hands",
        "summary": "📰 싱가포르 관련 뉴스\n📝 Tuesday, 12 pmProperty InsightsGet an exclusive analysis of real estate and property news in Singapore and beyond.  Tuesday, 12 pmProperty InsightsGet an exclusive analysis of real estate and property news in Singapore and beyond...",
        "content": "Tuesday, 12 pmProperty InsightsGet an exclusive analysis of real estate and property news in Singapore and beyond. Tuesday, 12 pmProperty InsightsGet an exclusive analysis of real estate and property news in Singapore and beyond. Get an exclusive analysis of real estate and property news in Singapore and beyond. Macau property magnate Loi Keong Kuong and family sell five Pagoda Street shophouses for S$50. Macau property magnate Loi Keong Kuong and family sell five Pagoda Street shophouses for S$50. Macau property magnate Loi Keong Kuong and family sell five Pagoda Street shophouses for S$50. Copyright SPH Media. All rights reserved. Reuse this contentFeedback. Copyright SPH Media",
        "publish_date": "2025-07-19T08:08:01.634732"
      },
      {
        "site": "The Business Times",
        "title": "Tariffs, trade deals and Tokyo wobbles",
        "url": "https://www.businesstimes.com.sg/podcasts/tariffs-trade-deals-and-tokyo-wobbles",
        "summary": "📰 싱가포르 최신 뉴스\n📝 Japanese long-range bond yields swung this week, ahead of local elections.  PHOTO: ADOBE STOCK...",
        "content": "Japanese long-range bond yields swung this week, ahead of local elections. PHOTO: ADOBE STOCK. Japanese long-range bond yields swung this week, ahead of local elections. PHOTO: ADOBE STOCK. Japanese long-range bond yields swung this week, ahead of local elections. PHOTO: ADOBE STOCK. Japanese long-range bond yields swung this week, ahead of local elections. PHOTO: ADOBE STOCK. Japanese long-range bond yields swung this week, ahead of local elections. PHOTO: ADOBE STOCK",
        "publish_date": "2025-07-19T08:08:03.612824"
      }
    ],
    "article_count": 2,
    "sites": [
      "The Business Times"
    ],
    "timestamp": "2025-07-19T08:08:34.548818",
    "scraping_method": "traditional",
    "execution_type": "manual"
  },
  {
    "group": "News",
    "articles": [
      {
        "site": "Yahoo Singapore News",
        "title": "Property",
        "url": "https://sg.news.yahoo.com/property/",
        "summary": "📰 싱가포르, 비즈니스 관련 뉴스\n📝 Bangkok luxury homes to debut in Singapore at MQDC showcase in JulyBusinessEdgeProp.  Bangkok luxury homes to debut in Singapore at MQDC showcase in JulyBusinessEdgeProp...",
        "content": "Bangkok luxury homes to debut in Singapore at MQDC showcase in JulyBusinessEdgeProp. Bangkok luxury homes to debut in Singapore at MQDC showcase in JulyBusinessEdgeProp. Bangkok luxury homes to debut in Singapore at MQDC showcase in JulyBusinessEdgeProp",
        "publish_date": "2025-07-19T08:08:06.373880"
      }
    ],
    "article_count": 1,
    "sites": [
      "Yahoo Singapore News"
    ],
    "timestamp": "2025-07-19T08:08:34.548842",
    "scraping_method": "traditional",
    "execution_type": "manual"
  }
]